<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="de">
  <head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8"/>
    <title>Diffuse</title>
    <link rel="stylesheet" href="style.css"/>
    <link rel="shortcut icon" href="favicon.ico"/>
    <link rel="alternate" type="application/rss+xml" title="News" href="rss.xml" />
  </head>
  <body>
    <div id="page">
      <div id="header">
        <h1>Diffuse</h1>
        <h2>graphisches Werkzeug zum Zusammenf端hren und Vergleichen von Textdateien</h2>
      </div>
      <div id="topnav">
        <div style="float:right"><ul><li><a href="index_de.html">[de]</a></li><li><a href="index.html">[en]</a></li></ul></div>
        <ul><li><a href="index_de.html">Home</a></li><li><a href="about_de.html">&Uuml;ber</a></li><li><a href="download_de.html">Download</a></li><li><a href="screenshots_de.html">Screenshots</a></li><li><a href="manual_de.html">Dokumentation (en)</a></li></ul>
      </div>
      <div id="main">
        <div id="left">
          <h2>Navigation</h2>
          <div id="nav"><ul><li><a href="index_de.html">Home</a></li><li><a href="about_de.html">&Uuml;ber</a></li><li><a href="download_de.html">Download</a></li><li><a href="screenshots_de.html">Screenshots</a></li><li><a href="manual_de.html">Dokumentation (en)</a></li><li><a href="licence_de.html">Lizenz</a></li><li><a href="development_de.html">Entwicklung</a></li><li><a href="roadmap_de.html">Roadmap</a></li><li><a href="releasehistory_de.html">&Auml;nderungen</a></li></ul></div>
        </div>
        <div id="body"><h2>Wo wir hinwollen</h2>
<p>Wir wollen aus Diffuse das beste Werkzeug f&uuml;r Open Source Entwickler zum Aufl&ouml;sen von Konflikten beim Zusammenf&uuml;hren oder zum &Uuml;berpr&uuml;fen der &Auml;nderungen in ihrem Quelltext machen. Wir konzentrieren uns zur Zeit auf Zusammenf&uuml;hren und Vergleichen von Textdateien. Nachfolgend finden sie die Dinge, die wir erreichen wollen auf unserem Weg zu "Version 1.0.0". Diese Roadmap ist in Entwicklung und wird zusammen mit dem Projekt voranschreiten.</p>
<h2>Ziele f&uuml;r 0.5</h2>
<p>Wir teilen die Basis des Quelltextes von Diffuse in drei Hauptsektionen, von denen jede eine gut definierte Public API und einen einfachen Abh&auml;ngigkeitsgraphen haben wird. Die Inhalte dieser Sektionen werden haupts&auml;chlich:</p>
<p><strong>Grundlegende Verarbeitungsklassen:</strong></p>
<ul>
<li>einfaches r&uuml;ckg&auml;ngig/wiederholen Verwaltungssystem</li>
<li>Zeilenbasiertes zusammenf端hren / vergleichen</li>
</ul>
<p><strong>Widget Implementation:</strong></p>
<ul>
<li>PyGTK Widget zum Visualisieren und Bearbeiten der Daten</li>
<li>Syntax Hervorhebung</li>
</ul>
<p><strong>Anwendung:</strong></p>
<ul>
<li>Ger&uuml;st zur Anzeige von mehreren Fenstern und Reitern und Verwaltung aller Tasten und Men&uuml;s</li>
<li>Integration popul&auml;rer Open Source Versionsverwaltungen</li>
<li>Einstellungen</li>
<li>Kommandozeilensyntaxanalyse</li>
<li>Textkodierungs- und platformspezifische Sachen</li>
</ul>
<p>Diese &Auml;nderungen sollen es f&uuml;r andere Entwickler einfacher machen Quelltext beizutragen.</p>
<h2>Ziele f&uuml;r 0.6</h2>
<ul>
<li>Hinzuf&uuml;gen der M&ouml;glichkeit dynamisch Vergleichsfenster hinzuzuf&uuml;gen und zu entfernen</li>
<li>Hinzuf&uuml;gen eines Detailausschnittes um einfacher die meisten Unterschiede in den ausgew&auml;hlten Zeilen zu erkennen ohne scrollen zu m&uuml;ssen.</li>
</ul>
<h2>Ziele f&uuml;r 0.7</h2>
<ul>
<li>Hinzuf&uuml;gen eines otionalen Zusammenf端hr-Fensteres mit markierten in Konflikt stehenden zusammenzuf端hrenden Bl&ouml;cken.</li>
</ul>
<h2>Ziele f&uuml;r 0.8</h2>
<ul>
<li>Hinzuf&uuml;gen der M&ouml;glichkeit regul&auml;re Ausdr&uuml;cke zu verwenden um "kleinere" Unterschiede zu finden, die im Fenster abgedunkelt und beim Navigieren durch die Unterschiede &uuml;bersprungen werden</li>
<li>Unterschiedliche Ansicht und Editoreinstellungen je nach Dateityp</li>
<li>Verbesserung der Syntax Hervorhebung, sodass auch Muster wie verschachtelte Elemente, beliebige Trennzeichen und mehrzeilige Muster erkannt werden (z.B. Lange Kommentare im Lua Stil, &Uuml;berschriften in neu strukturiertem Text, suchen/ersetzen Trennzeichen in Perl)</li>
</ul>
<h2>Ziele f&uuml;r sp&auml;tere Vesionen</h2>
<ul>
<li>Verbesserung der Anzeige mit Unterst&uuml;tzung von automatischem Zeilenumbruch und Anzeige von Unterschieden in einer Zeile mit Detailgenauigkeit auf Wortebene</li>
<li>Alle Werte, die in der Konfigurationsdatei ge&auml;ndert werden k&ouml;nnen auch in der grafische Benutzeroberfl&auml;che zug&auml;nglich machen.</li>
<li>Verbesserung der Windows Kommandozeilen-Intergration um Benutzern das &Ouml;ffnen mehrerer Dateien f&uuml;r gemeinsamen Vegleich zu erlauben.</li>
</ul></div>
      </div>
      <div style="clear:both;"></div>
      <div id="footer">
        <div style="float:right">Hosting by <a href="http://sourceforge.net/">SourceForge.net</a></div>
        Copyright &copy; 2006-2013 Derrick Moser, Henri Menke
      </div>
    </div>
  </body>
</html>